Revit 2027 API
ExportLineweightKey(ExportLineweightKey) Constructor
 Constructs a new copy of the input ExportLineweightKey object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportLineweightKey(
	ExportLineweightKey other
)
Public Sub New (
	other As ExportLineweightKey
)
public:
ExportLineweightKey(
	ExportLineweightKey^ other
)
new :
        other : ExportLineweightKey -> ExportLineweightKey
Parameters
other ExportLineweightKey
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportLineweightKey Class
ExportLineweightKey Overload
Autodesk.Revit.DB Namespace